{
  "rooms": [
    {
      "id": "Captain's Quarters",
      "name": "Captain's Quarters",
      "longdescription": "The Captain's Quarters and main control area of the ship. It features a chair where a captain would usually control the ship, and there is a control panel with a large red button in front of you. There is a large closed door at the west end of the room. ",
      "shortdescription":"The main control area of the ship, featuring a control panel and a large red button in front of you, with a closed door to the west.",
      "exits": [
        {
          "isLocked": true,
          "direction": "West",
          "adjacentRoom": "Bridge",
           "keyId" : "1111"
        }
      ]
    },
    {
      "id": "Bridge",
      "name": "Bridge",
      "longdescription": "A long, glass bridge leading to another area of the ship. You see the control room behind you, and the echoing of faint sounds in the distance. ",
      "shortdescription":"A glass bridge, leading to other areas of the ship.",
      "exits": [
        {
          "isLocked": false,
          "direction": "West",
          "adjacentRoom": "Hallway"
        }
      ]
    },
    {
      "id": "Hallway",
      "name": "Hallway",
      "longdescription": "A long, dimly lit hallway, which has multiple doors, to the north, south, and west. There is a gun laying on top of a table in front of the south door. You suddenly hear a loud sound, of an creature communicating in another language.  ",
      "shortdescription":"A dimly lit hallway, with doors leading to the north, south and west. There is a gun laying on top of a table to the south, and you suddenly hear a loud, foreign language.",
      "exits": [
        {
          "isLocked": false,
          "direction": "North",
          "adjacentRoom": "Communication Room"
        },
        {
          "isLocked": false,
          "direction": "West",
          "adjacentRoom": "Situation room"
        },
        {
          "isLocked": true,
          "direction": "South",
          "adjacentRoom": "Storage Room",
          "keyId": "4567"
        },
        {
          "isLocked": true,
          "direction": "East",
          "adjacentRoom": "Bridge"
        }
      ]
    },
    {
      "id": "Communication Room",
      "name": "Communication Room",
      "longdescription": "A glass room, with a faint, white light. In front of you you can hear the faint sounds of a radio, where you can hear someone talking in the same alien language you heard earlier. There are also knobs to adjust the volume, and a walkie talkie in front of you.",
      "shortdescription":"A room where in front of you is a radio where someone is speaking in an alien language, and a walkie talkie that is switched off.",
      "exits": [
        {
          "isLocked": false,
          "direction": "South",
          "adjacentRoom": "Hallway"
        }
      ]
    },
    {
      "id": "Situation Room",
      "name": "Situation Room",
      "longdescription": "A small, glass, room, where you can see the view of the Earth and space outside. There is also a holographic display table that appears to be broken, with nothing on it.",
      "shortdescription":"A glass room featuring a view of space, and a holographic display table that appears to be broken.",
      "exits": [
        {
          "isLocked": false,
          "direction": "East",
          "adjacentRoom": "Hallway"
        }
      ]
    },
    {
      "id": "Storage Room",
      "name": "Storage Room",
      "longdescription": "The storage room is a large, cluttered space. Boxes and crates line the walls, filled with everything from what look like weapons, to other supplies and equipment for the ship. All boxes are locked except for one, but they look like they haven't been opened in a while. There is also something under the unlocked box.",
      "shortdescription":"A small room used for storing supplies and equipment. There is an unlocked box with something under it. ",
      "exits": [
        {
          "isLocked": false,
          "direction": "East",
          "adjacentRoom": "Mess Hall"
        },
         {
          "isLocked": false,
          "direction": "West",
          "adjacentRoom": "Crew Lounge"
         }
      ]
    },
    
    {
      "id": "Mess Hall",
      "name": "Mess Hall",
      "longdescription": "A cafeteria, which has long tables and benches, used to be where the crew gathered to eat and discuss daily activities, but now it sits empty. There is a sandwhich and a bottle of water on the table.",
      "shortdescription":"A cafeteria, which is empty, and has a sandwhich and a bottle of water on a table.",
      "exits": [
        {
          "isLocked": false,
          "direction": "West",
          "adjacentRoom": "Storage Room"
        },
        {
          "isLocked": false,
          "direction": "South",
          "adjacentRoom": "Kitchen"
        }
      ]
    },
    {
      "id": "Kitchen",
      "name": "Kitchen",
      "longdescription": "A functional space where meals are prepped for the mess hall. It is equipped with advanced cooking appliances and storage for ingredients.  ",
      "shortdescription":"A space for food preperation and storage.",
      "exits": [
        {
            "isLocked": false,
            "direction": "North",
            "adjacentRoom": "Mess Hall"
          }
        
      ]
    },
    {
      "id": "Crew Lounge",
      "name": "Crew Lounge",
      "longdescription": "A relaxed area with comfortable seating, entertainment, games, and books. It looked like people used to be here. There is a case with a red box in the corner of the room. ",
      "shortdescription":"A lounge area with comfortable seating and entertainment systems",
      "exits": [
        {
          "isLocked": false,
          "direction": "West",
          "adjacentRoom": "Crew Cabins"
        },
        {
          "isLocked": false,
          "direction": "East",
          "adjacentRoom": "Storage Room"
        },
        {
          "isLocked": false,
          "direction": "South",
          "adjacentRoom": "Medical Bay"
        }
      ]
    },
    {
      "id": "Medical Bay",
      "name": "Medical Bay",
      "longdescription": "A well equipped facility for treating illnesses,  injuries, and conducting medical examinations. There is another holographic screen that displays nothing, and edits to the south, west and east, and the east has some kind of scanner in front of it.",
      "shortdescription":" A facility for treating illnesses. There is a broken holographic display in the corner.",
      "exits": [
        {
          "isLocked": false,
          "direction": "West",
          "adjacentRoom": "Doctor's Office"
        }, 
        {
          "isLocked": false,
          "direction": "South",
          "adjacentRoom": "Hallway 2"
        },
        {
          "isLocked": true,
          "direction": "East",
          "adjacentRoom": "Engineering Room",
          "keyId": "2222"
        },
        {
          "isLocked": false,
          "direction": "North",
          "adjacentRoom": "Crew Lounge"
        }
      ]
    },
    {
      "id": "Engineering Room",
      "name": "Engineering Room",
      "longdescription": "An area filled with the ship's technical operations. It's has  various consoles, monitors, and tools necessary for maintaining and repairing the ship. There is a red keycard on the floor.",
      "shortdescription":"The area for the ship's techninical operations ",
      "exits": [
        {
          "isLocked": false,
          "direction": "West",
          "adjacentRoom": "Medical Bay"
        }
      ]
    },
    {
      "id": "Crew Cabins",
      "name": "Crew Cabins",
      "longdescription": "Small, personal rooms where crew members sleep and keep their belongings. Each cabin is personalized with the occupant's items. You see a note on one of the tables.",
      "shortdescription":"Personal rooms for the crew, filled with their belongings. There is a note on a table.",
      "exits": [
        {
          "isLocked": false,
          "direction": "East",
          "adjacentRoom": "Crew Lounge"
        }
      ]
    },
    {
      "id": "Doctor's Office",
      "name": "Doctor's Office",
      "longdescription": "A private office where medical records are stored and medical procedures are conducted. There are photos of the doctor and their family members all over the room.",
      "shortdescription":"",
      "exits": [
        {
          "isLocked": false,
          "direction": "East",
          "adjacentRoom": "Medical Bay"
        }
      ]
    },
    {
      "id": "Workshop",
      "name": "Workshop",
      "longdescription": "The workshop is a cluttered space with workbenches covered in various projects. Shelves line the walls, filled with components and materials for crafting and repairing ship parts. You here sounds in the room next to you, and there is a wire hanging from the Engineering Room which looks like it could be connected to some kind of supply.",
      "shortdescription":"The workshop is a  space with workbenches and materials for crafting and repairing ship parts. There is a wire hanging where a power supply could be connected.",
      "exits": [
        {
          "isLocked": false,
          "direction": "West",
          "adjacentRoom": "Hallway"
        },
        {
          "isLocked": true,
          "direction": "East",
          "adjacentRoom": "Reactor Room",
          "keyId": ["8888", "9999"]
        },
        {
          "isLocked": false,
          "direction": "South",
          "adjacentRoom": "Droid Maintenence"
        }
        
      ]
    },
    {
      "id": "Hallway 2",
      "name": "Hallway",
      "longdescription":"A dimly lit hallway stretches through the ship, qith doors to the north, east, and south. You hear faint sounds in the distance. ",
      "shortdescription":"A corridor connecting many parts of the ship",
      "exits": [
        {
          "isLocked": false,
          "direction": "North",
          "adjacentRoom": "Medical Bay"
        },
        {
          "isLocked": false,
          "direction": "South",
          "adjacentRoom": "Cargo Hold"
        },
        {
          "isLocked": false,
          "direction": "East",
          "adjacentRoom": "Workshop"
        }
      ]
    },
    {
      "id": "Cargo Hold",
      "name": "Hallway",
      "longdescription":"The Cargo Hold is a vast space filled with crates and containers of various sizes. The air is filled with the scent of metal and machinery, and the sounds in the distance have gotten louder.",
      "shortdescription":"An area with various containers and crates.",
      "exits": [
        {
          "isLocked": true,
          "direction": "West",
          "adjacentRoom": "Shuttle Bay",
          "keyId": "3333"
        },
        {
          "isLocked": false,
          "direction": "North",
          "adjacentRoom": "Hallway 2"
        },
        {
          "isLocked": true,
          "direction": "South",
          "adjacentRoom": "Supply Room",
          "keyId": "4444"
        },
        {
        "isLocked": false,
          "direction": "East",
          "adjacentRoom": "Droid Maintenence"
      }
      ]
    },
      
    {
      "id": "Shuttle Bay",
      "name": "Shuttle Bay",
      "longdescription":"The Shuttle Bay is a large, open space designed to house and launch shuttles for planetary exploration. Several shuttles are docked here, each ready for immediate deployment. When you walk in, you see a droid that comes towards you, and it seems to be guarding something.",
      "shortdescription":"A large space for housing and launching shuttles. There is a droid who is guarding something.",
      "exits": [
        {
          "isLocked": false,
          "direction": "East",
          "adjacentRoom": "Cargo Hold"
        }
      ]
        },
        {
          "id": "Droid Maintenence",
          "name": "Droid Maintenence",
          "longdescription":"This room is dedicated to the maintenance and repair of the ship's droids. It's equipped with diagnostic stations, repair tools, and spare parts for various types of droids. The room is tidy and organized, and there is a red button in the corner. You suddenly hear a loud alarm and multiple droids come rushing towards you. ",
          "shortdescription":"A room dedicated to the maintenance and repair of the ship's droids, equipped with repair tools. There is a red button in the corner, and you suddenly see multiple droids coming towards you.",
          "exits": [
            {
              "isLocked": false,
              "direction": "North",
              "adjacentRoom": "Workshop"
            },
            {
            "isLocked": false,
              "direction": "West",
              "adjacentRoom": "Cargo Hold"
            }
          ]
        },
            {
              "id": "Reactor Room",
              "name": "Reactor Room",
              "longdescription":" A room with the ship's main power source. It's a large, area with a massive reactor at its center, filled with energy. There is a tense atmosphere, and you feel like someone else is watching you. You suddenly see your friend in some kind of a box, with a large droid and an alien guarding it. An alarm sounds and they come towards you.",
              "shortdescription":"A large room with the ship's power source, you see your friend trapped in the corner guarded by a large alien and droid, and they come towards you.",
              "exits": [
                {
                  "isLocked": false,
                  "direction": "West",
                  "adjacentRoom": "Workshop"
                }
      ]
    },
    
    {
      "id": "Supply Room",
      "name": "Supply Room",
      "longdescription":" The Supply Room is a well-organized space filled with shelves stocked with various supplies. Everything is neatly labeled and stored here. You suddenly see an alien who runs towards you, speaking in a foreign language.",
      "shortdescription":"A well-organized room stocked with various supplies. You see an alien running towards you.",
      "exits": [
        {
          "isLocked": false,
          "direction": "North",
          "adjacentRoom": "Cargo Hold"
        }
  ]
}
  ]
}
